
[
  {
    "id": "job-1",
    "title": "Senior Frontend Engineer (React)",
    "department": "Engineering",
    "description": "We are seeking a highly skilled Senior Frontend Engineer to lead the development of our next-generation user interfaces. You will be responsible for building, testing, and deploying complex, scalable, and performant web applications using React and the latest frontend technologies. The ideal candidate has a passion for creating beautiful, intuitive user experiences and a strong understanding of modern web development principles.",
    "requirements": [
      "5+ years of professional experience in frontend development.",
      "Expert-level proficiency in JavaScript, React, and TypeScript.",
      "Deep understanding of state management libraries like Redux or Zustand.",
      "Experience with Next.js and server-side rendering (SSR).",
      "Proficient in writing clean, maintainable code and unit tests with Jest/RTL.",
      "Strong knowledge of HTML5, CSS3, and responsive design principles."
    ],
    "status": "Open",
    "postedBy": "user-2",
    "createdAt": "2024-05-20T10:00:00Z"
  },
  {
    "id": "job-2",
    "title": "AI Prompt Engineer",
    "department": "Innovation",
    "description": "As an AI Prompt Engineer, you will be at the forefront of our generative AI initiatives. You will specialize in designing, refining, and optimizing prompts for large language models (LLMs) to generate high-quality, accurate, and contextually relevant content. This role requires a unique blend of creativity, linguistic precision, and technical understanding of AI systems.",
    "requirements": [
      "Proven experience in prompt engineering or working extensively with LLMs (e.g., Gemini, GPT-4).",
      "Excellent command of the English language with a talent for creative and technical writing.",
      "Basic understanding of machine learning concepts and how LLMs work.",
      "Ability to analyze AI-generated content and provide feedback for model tuning.",
      "Experience with scripting languages like Python for automation is a plus.",
      "A portfolio of sophisticated prompts and their outputs is highly desirable."
    ],
    "status": "Open",
    "postedBy": "user-1",
    "createdAt": "2024-05-18T14:30:00Z"
  },
  {
    "id": "job-3",
    "title": "Lead Product Designer (UX/UI)",
    "department": "Design",
    "description": "We are looking for a visionary Lead Product Designer to own the user experience and interface design for our flagship products. You will guide the entire design process, from user research and wireframing to high-fidelity mockups and prototyping. You will work closely with product managers and engineers to translate complex problems into elegant, user-centric solutions.",
    "requirements": [
      "7+ years of experience in product design, with a strong portfolio showcasing your work.",
      "Mastery of design tools such as Figma, Sketch, or Adobe XD.",
      "Extensive experience with user research, usability testing, and creating design systems.",
      "Proven ability to lead design projects and mentor other designers.",
      "Strong communication skills to articulate design decisions to stakeholders.",
      "Experience designing for both web and mobile platforms."
    ],
    "status": "Closed",
    "postedBy": "user-2",
    "createdAt": "2024-04-15T09:00:00Z"
  },
  {
    "id": "job-4",
    "title": "Cloud Infrastructure Engineer",
    "department": "Platform Engineering",
    "description": "As a Cloud Infrastructure Engineer, you will be responsible for designing, building, and maintaining our scalable and reliable cloud infrastructure on Google Cloud Platform (GCP). You will work with technologies like Kubernetes, Terraform, and Docker to automate our infrastructure and deployment pipelines, ensuring our services are secure, available, and performant.",
    "requirements": [
      "4+ years of experience in a DevOps or Infrastructure Engineering role.",
      "Hands-on experience with Google Cloud Platform (GCP) or another major cloud provider (AWS, Azure).",
      "Proficiency with Infrastructure as Code (IaC) tools, particularly Terraform.",
      "Strong knowledge of containerization and orchestration (Docker, Kubernetes).",
      "Experience with CI/CD pipelines (e.g., Jenkins, GitLab CI, GitHub Actions).",
      "Familiarity with monitoring and logging tools like Prometheus, Grafana, or the ELK stack."
    ],
    "status": "Open",
    "postedBy": "user-3",
    "createdAt": "2024-05-25T12:00:00Z"
  }
]
